# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


list_ = [2, 3, 5, 6]

if  len(list_)%2 == 0:
    size = round(len(list_)/2)
else:
    size = round(len(list_)/2) + 1
numb = []
for i in range(size): 
    numb.append(list_[i] * list_[len(list_)-1 -i]) 
print(f'Для списка - {list_} произведение пар чисел первого и последнего элементов, будет : {numb}')